In [1]:
import numpy as np
import pandas as pd

In [2]:
df=pd.read_csv('titanic.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [3]:
import math
df.Age=df.Age.fillna(df.Age.mean())

In [4]:
target=df['Survived']
target.head()

0    0
1    1
2    1
3    1
4    0
Name: Survived, dtype: int64

In [5]:
inputs=df.drop(['Name','SibSp','Parch','Ticket','Cabin','Embarked','PassengerId','Survived'],axis='columns')
inputs.head()

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

In [6]:
dummies=pd.get_dummies(inputs.Sex)
dummies.head()
inp_dummies=pd.concat([inputs,dummies],axis='columns')
inp_dummies.head()

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [7]:
inp_dummies.drop(['Sex'],axis='columns',inplace=True)
inp_dummies.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [8]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test=train_test_split(inp_dummies,target,test_size=0.2)
inp_dummies.female.head()

0    0
1    1
2    1
3    1
4    0
Name: female, dtype: uint8

In [9]:
X_test.head()

     Pclass   Age     Fare  female  male
769       3  32.0   8.3625       0     1
18        3  31.0  18.0000       1     0
16        3   2.0  29.1250       0     1
115       3  21.0   7.9250       0     1
442       3  25.0   7.7750       0     1

In [10]:
from sklearn import tree
model=tree.DecisionTreeClassifier()

In [11]:
X_train.head()

     Pclass        Age      Fare  female  male
527       1  29.699118  221.7792       0     1
113       3  20.000000    9.8250       1     0
243       3  22.000000    7.1250       0     1
555       1  62.000000   26.5500       0     1
567       3  29.000000   21.0750       1     0

In [12]:
model.fit(X_train,y_train)

DecisionTreeClassifier(class_weight=None, criterion='gini', max_depth=None,
            max_features=None, max_leaf_nodes=None,
            min_impurity_decrease=0.0, min_impurity_split=None,
            min_samples_leaf=1, min_samples_split=2,
            min_weight_fraction_leaf=0.0, presort=False, random_state=None,
            splitter='best')

In [13]:
model.score(X_test,y_test)

0.7653631284916201

In [14]:
model.predict([[1,20,200,0,1]])

array([0], dtype=int64)